# OSI 7 Layers
- Network : 사용자 혹은 데이터가 어떤 곳에서 다른 곳으로 이동할 수 잇게 만든 통로. 현대의 네트워크는 TCP/IP를 이용하고 어더한 곳이든 접근이 가능하다.  
- OSI(Open System Interconnection) 7 Layer : 네트워크 분야에서 가장 중요하게 다루는 것으로서 세계적으로 사용이 되고 있는 네트워크 표준 모델. 이 안에 TCP/IP 및 네트워크 통신에 사용되는 전반적인 프로토콜이 포함되어 있다.  

 1) Application Layer (응용 계층) : 사용자가 또는 어플리케이션이 네트워크에 접근할 수 있도록 해줌. 사용자를 위한 인터페이스 지원  
 
 2) Presentation Layer (표현 계층) : 데이터 인코딩 및 디코딩 압축, 암호화를 담당 (곧통된 표준 형식에 맞춘다.)  
 3) Session Layer (세션 계층) : 통신을 관리하기 위한 방법을 정의 (단방향, 양방향 등)  
 4) Presentation Layer (표현 계층) : Port Number를 통해 송신자와 수신자를 연결하는 통신 서비스를 제공한다. 대표적인 프로토콜으로는 TCP, UDP가 있음. (편지로 치면 사람 이름)  // 데이터 전송 단위 : TCP (Segment), UDP (Datagram)
 5) Network Layer (네트워크 계층) : 송수신 호스트 사이의 패킷 전달을 제어하는 **라우팅**과 **패킷 전달**을 담당한다. IP Address를 이용해 데이터를 보낸다.(편지로 치면 주소)  // 데이터 전송 단위 : Packet (패킷) 
 6) DataLink Layer (데이터링크 계층) : 인접한 노드간의 신뢰성 있는 프레임(Frame) 전송을 담당하는 계층. MAC Address를 이용해 Node에게 정보를 제공 // 데이터 전송 단위  :Frame (프레임)(편지로 치면 몇동 몇호)
 7) Physical Layer (물리 계층) : 프레임을 구리나 광섬유(케이블) 또는 무선 통신 매체를 통신해 전송하기 위한 신호로 바꾸어 준다. // 데이터 전송 단위 : bit (비트)

 - Encapsulation : 7계층부터 1계층까지 내려가면서 각각의 데이터를 합치는 과정.  
 - Decasulation : 수신측에서 7계층부터 1계층까지 올라가면서 데이터를 확인하는 여러 절차들.  
